
## Plan Result (terraform/cloudflare/b0xp.io/argocd)

[CI link](https://github.com/boxp/arch/actions/runs/15815815976)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * time_rotating.token_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # time_rotating.token_rotation will be created
  + resource "time_rotating" "token_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with cloudflare_access_application.argocd,
  on access.tf line 2, in resource "cloudflare_access_application" "argocd":
   2: resource "cloudflare_access_application" "argocd" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 19 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.argocd,
  on dns.tf line 5, in resource "cloudflare_record" "argocd":
   5:   value   = cloudflare_tunnel.argocd_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Deprecated Resource

  with cloudflare_access_application.argocd,
  on access.tf line 2, in resource "cloudflare_access_application" "argocd":
   2: resource "cloudflare_access_application" "argocd" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 19 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.argocd,
  on dns.tf line 5, in resource "cloudflare_record" "argocd":
   5:   value   = cloudflare_tunnel.argocd_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":4176,"Program":"tfcmt","SHA1":"090eaa6e1ed25c8748a388125f95950ae06a3560","Target":"terraform/cloudflare/b0xp.io/argocd","Vars":{},"WorkflowName":"pull_request_target"} -->